create_clock -name sclk -period 1 [get_ports clk]
set_clock_latency -source -max 0.5 [get_clocks sclk]
set_input_delay -max 0.5 [get_ports * -filter "direction==in" ] -clock [get_clocks "sclk"]
set_output_delay 0.5 [get_ports * -filter "direction==in" ] -clock [get_clocks "sclk"]
set_clock_transition -rise 0.1 [get_clocks sclk]
set_clock_transition -fall 0.1 [get_clocks sclk]
set_clock_uncertainty -setup 2 [get_clocks sclk]
set_clock_uncertainty -hold 2 [get_clocks sclk]
